<?php
return [
    // ★API 側の team_name / stadium_name / club_name と一致する「正規名」に寄せる
    // ★一軍、ファームは分けておく

    // 一軍
    'teams_first' => [
        '阪神' => '阪神タイガース（一軍）',
        '広島' => '広島東洋カープ（一軍）',
        '読売' => '読売ジャイアンツ（一軍）',
        '巨人' => '読売ジャイアンツ（一軍）',
        '中日' => '中日ドラゴンズ（一軍）',
        'ヤクルト' => '東京ヤクルトスワローズ（一軍）',
        '横浜' => '横浜DeNAベイスターズ（一軍）',
        'DeNA' => '横浜DeNAベイスターズ（一軍）',
        'ロッテ' => '東京ロッテマリーンズ（一軍）',
        'ソフトバンク' => '福岡ソフトバンクホークス（一軍）',
        'オリックス' => 'オリックス・バファローズ（一軍）',
        '西武' => '埼玉西武ライオンズ（一軍）',
        '日本ハム' => '北海道日本ハムファイターズ（一軍）',
        '楽天' => '東北楽天ゴールデンイーグルス（一軍）',
    ],

    // ファーム
    'teams_farm' => [
        '阪神' => '阪神タイガース（ファーム）',
        '広島' => '広島東洋カープ（ファーム）',
        '読売' => '読売ジャイアンツ（ファーム）',
        '巨人' => '読売ジャイアンツ（ファーム）',
        '中日' => '中日ドラゴンズ（ファーム）',
        'ヤクルト' => '東京ヤクルトスワローズ（ファーム）',
        '横浜' => '横浜DeNAベイスターズ（ファーム）',
        'DeNA' => '横浜DeNAベイスターズ（ファーム）',
        'ロッテ' => '東京ロッテマリーンズ（ファーム）',
        'ソフトバンク' => '福岡ソフトバンクホークス（ファーム）',
        'オリックス' => 'オリックス・バファローズ（ファーム）',
        '西武' => '埼玉西武ライオンズ（ファーム）',
        '日本ハム' => '北海道日本ハムファイターズ（ファーム）',
        '楽天' => '東北楽天ゴールデンイーグルス（ファーム）',
        'くふうハヤテ' => 'くふうハヤテベンチャーズ静岡（ファーム）',
        'オイシックス' => 'オイシックス新潟アルビレックスBC（ファーム）'
    ],

    // 球場
    'stadiums' => [
        '東京ドーム' => '東京ドーム',
        '甲子園' => '阪神甲子園球場',
        'バンテリンドーム' => 'バンテリンドーム ナゴヤ',
        'マツダスタジアム' => 'MAZDA Zoom-Zoom スタジアム広島',
        'エスコンF' => 'エスコンフィールドHOKKAIDO',
        '神宮' => '明治神宮野球場',
        '京セラD大阪' => '京セラドーム大阪',
        'ベルーナドーム' => 'ベルーナドーム',
        'みずほPayPay' => 'みずほPayPayドーム福岡',
        '楽天モバイル' => '楽天モバイルパーク宮城',
        'ZOZOマリン' => 'ZOZOマリンスタジアム',
        '横浜' => '横浜スタジアム',
    ],

    // クラブ
    'clubs' => [
        '阪神' => '阪神タイガース',
        '広島' => '広島東洋カープ',
        '読売' => '読売ジャイアンツ',
        '巨人' => '読売ジャイアンツ',
        '中日' => '中日ドラゴンズ',
        'ヤクルト' => '東京ヤクルトスワローズ',
        '横浜' => '横浜DeNAベイスターズ',
        'DeNA' => '横浜DeNAベイスターズ',
        'ロッテ' => '東京ロッテマリーンズ',
        'ソフトバンク' => '福岡ソフトバンクホークス',
        'オリックス' => 'オリックス・バファローズ',
        '西武' => '埼玉西武ライオンズ',
        '日本ハム' => '北海道日本ハムファイターズ',
        '楽天' => '東北楽天ゴールデンイーグルス',
        'くふうハヤテ' => 'くふうハヤテベンチャーズ静岡',
        'オイシックス' => 'オイシックス新潟アルビレックスBC'
    ],
];
